package com.hmtmcse.basic;

/**
 * Created by Touhid Mia on 15/03/2015.
 */
public class Test {

    public static void main(String[] args) {
        String text = "[গান]\n" + "কাকলি ॥ \n" + "আঁধার রাতে কে গো একেলা ।\n" + "নয়ন-সলিলে ভাসালে ভেলা ॥ \n" + "কি দুখে আজি যোগিনী সাজি’\n" + "আপনার লয়ে এ হেলা-ফেলা ॥ \n" + " \n" + "সোনার কাঁকন ও দুটি করে \n" + "হের গো জড়ায়ে মিনতি করে । \n" + "ফেলিয়া ধূলায় দিও না গো তায়\n" + "সাধিছে নূপুর চরণ ধরে ।\n" + "কাঁদিয়া কারে খোঁজে ওপারে\n" + "আজও যে তোমার প্রভাত বেলা ॥\n" + "কৃষ্ণা ॥ দেখছিস কাকলি, এই তার দৃপ্ত পদরেখা । (পথ হইতে একটি পদদলিত রাঙা গোলাব তুলিয়া লইয়া) এই তার পায়ে-দলা রক্ত গোলাব, এমনি ক’রে ফুল আর হৃদয় দ’লে সে তার পায়ের তলার পথ রক্ত-রাঙা ক’রে চ’লে যায় ।\n" + "কাকলি ॥ কেন ভাই, আলেয়ার পিছনে ঘুরে মরছ ? হৃদয় দ’লে চলায় যার ধর্ম, কেন-\n" + "কৃষ্ণা ॥ তুই ভুল বুঝেছিস্ কাকলি ! আমি ওর কথা ভেবে কষ্ট পাই নারী ব’লে । বন্ধু ব’লে । তবু ও আলো কেন যেন কেবলি টানতে থাকে । আমি প্রাণপণে বাঁধা দিই । মাঝে মাঝে হয়ত মনে হয়, ওই মিথ্যার পেছনে ঘোরার চেয়ে বুঝি বড় আনন্দ আমার জীবনে আর নেই । হৃদয়ের না হলেও ও ত শৈশবে বন্ধু ছিল । ... আচ্ছা কাকলি, তুই যে গান গাইলি এ কার কাছে শিখেছিস্?\n" + "কাকলি ॥ কবি মধুশ্রবার কাছে ।\n" + "কৃষ্ণা ॥ কবি মধুশ্রবা ! এমন চোখের জলের গান সে লিখলে? সে যে আনন্দের পাখী, সে ত দুঃখ-বেদনাকে স্বীকারই করে না ! সবাই দেখছি তা’হলে আলেয়ার পেছনে ঘুরছে ! \n" + "কাকলি ॥ এ কথা আমিও কবিকে বলেছিলুম । সে হেসে বললে, কাঁটার মুখে যে ফুলের স্বার্থকতা আমি তাকেই দেখি, আমার বুকের তারগুলো ব্যাথায় অত টনটন করে ওঠে ব’লেই ত হাতে এমন বীণা বাজে । \n" + "কৃষ্ণা ॥ (চিন্তিত হইয়া) হুঁ, আমি বুঝেছি কাকলি । কবি এক-একদিন কেমন ক’রে যেন আমার দিকে চায় । (একটু ভাবিয়া) কিন্তু সে তার কথার ঝড়ে মনের মেঘ কেবলেই দক্ষিণ থেকে উত্তরে ঠেলে দেয় । ও-ই সব চেয়ে সুখী ! কোনো কিছু দাবী করে না, কেবল দিয়েই ওর আনন্দ ।\n" + "[চন্দ্রকেতুর প্রবেশ]\n" + "সেনাপতি, তুমি এখানে ! তুমি সীমান্ত রক্ষা করতে যাওনি? কাকলি তুই চল, আমি যাচ্ছি । \n";
        System.out.println(text.substring(1462));
        System.out.println("কৃষ্ণা ॥ তুই ভুল বুঝেছিস্ কাকলি ! আমি ওর কথা ভেবে কষ্ট পাই নারী ব’লে । বন্ধু ব’লে । তবু ও আলো কেন যেন কেবলি টানতে থাকে । আমি প্রাণপণে বাঁধা দিই । মাঝে মাঝে হয়ত মনে হয়, ওই মিথ্যার পেছনে ঘোরার চেয়ে বুঝি বড় আনন্দ আমার জীবনে আর নেই । হৃদয়ের না হলেও ও ত শৈশবে বন্ধু ছিল । ... আচ্ছা কাকলি, তুই যে গান গাইলি এ কার কাছে শিখেছিস্?".length());
        

    }
    
}
